src/InformationRegisters/МФМакеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>МФМакеты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Макет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормаСуществует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МакетСуществует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МакетСовпадает</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/МФМакеты/Ext/ManagerModule.bsl
//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция МакетОписанияМодификаций(ИмяФормы, ИмяМакетаОписанияМодификаций) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый ТекстовыйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МФМакеты.Макет КАК Макет
	               |ИЗ
	               |	РегистрСведений.МФМакеты КАК МФМакеты
	               |ГДЕ
	               |	МФМакеты.ИмяМакета = &ИмяМакета";
	Запрос.УстановитьПараметр("ИмяМакета", ИмяМакетаОписанияМодификаций);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ТекстШаблона = ВыборкаДетальныеЗаписи.Макет.Получить();
		Результат.УстановитьТекст(ТекстШаблона);
	Иначе
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИмяМакета.Установить(ИмяМакетаОписанияМодификаций);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ИмяМакета = ИмяМакетаОписанияМодификаций;
		НоваяЗапись.Макет = Новый ХранилищеЗначения("", Новый СжатиеДанных(9));
		
		НаборЗаписей.Записать();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
КонецФункции

Функция МакетыОписанияМодификаций() Экспорт
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_МакетыОписанияМодификаций();
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекстМакета = ВыборкаДетальныеЗаписи.Макет.Получить();
		Результат.Вставить(
			ВыборкаДетальныеЗаписи.ИмяМакета,
			ТекстМакета
		);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Процедура ОбновитьМакетОписанияМодификаций(ИмяФормы, ИмяМакетаОписанияМодификаций, ТекстМакетаОписанияМодификаций) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = СоздатьМенеджерЗаписи();
	Сжатие = Новый СжатиеДанных(9);
	Запись.ИмяМакета = ИмяМакетаОписанияМодификаций;
	Запись.Макет = Новый ХранилищеЗначения(
		ТекстМакетаОписанияМодификаций,
		Сжатие
	);
	Запись.Записать();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура УдалитьМакетОписанияМодификаций(ИмяМакетаОписанияМодификаций) Экспорт
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИмяМакета.Установить(ИмяМакетаОписанияМодификаций);
	НаборЗаписей.Записать();
КонецПроцедуры

Функция ИменаМакетов() Экспорт
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_ИменаМакетов();
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат.Добавить(ВыборкаДетальныеЗаписи.ИмяМакета);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапроса_МакетыОписанияМодификаций()
	Возврат "ВЫБРАТЬ
	        |	МФМакеты.ИмяМакета КАК ИмяМакета,
	        |	МФМакеты.Макет КАК Макет
	        |ИЗ
	        |	РегистрСведений.МФМакеты КАК МФМакеты";
КонецФункции

Функция ТекстЗапроса_ИменаМакетов()
	Возврат "ВЫБРАТЬ
	        |	МФМакеты.ИмяМакета КАК ИмяМакета
	        |ИЗ
	        |	РегистрСведений.МФМакеты КАК МФМакеты
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	ИмяМакета";
КонецФункции

#КонецОбласти

#КонецЕсли
